YangQwQ/Stm32VisionSenseCar/Stm32-Vision/src/net/app_httpd.cpp
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#include "esp_http_server.h"
#include "esp_timer.h"
#include <freertos/semphr.h>   // WS 帧发送串行化用的互斥量
#include "esp_camera.h"
#include "img_converters.h"
#include "fb_gfx.h"
#include <string.h>
#include <stdlib.h>
#include "esp32-hal-ledc.h"
#include "sdkconfig.h"
#include "lwip/sockets.h"
// lwip 的 inet.h（经上行 sockets.h:53 引入）把 INADDR_NONE/IPADDR_NONE 定义成宏，而 Arduino
// core 的 IPAddress.h 声明同名全局对象（extern const IPAddress INADDR_NONE），宏会在声明处
// 展开破坏语法；lwip 为预编译库，此处撤销宏不影响其编译期使用。
// ⚠️ 这两行必须紧跟 lwip/sockets.h。IPAddress.h 由 Arduino.h:198 引入，因此任何直接或间接
//    拉进 Arduino.h 的头都只能排在其后，否则报 "expected ')' before numeric constant"
//    （踩过的实例：BLEDevice.h → BLEServer.h:45 → Arduino.h → IPAddress.h）。
#undef INADDR_NONE
#undef IPADDR_NONE
#include "esp_heap_caps.h"
#include "esp_core_dump.h"   // /coredump：panic 现场（原因串 + 任务 + 回溯 PC）
#include "src/cam/camera.h"       // cam::grab / cam::jpeg_len（后者见 camera.cpp 的说明）
#include "src/cam/camera_index.h"
#include "src/net/ota.h"   // HTTP OTA 入口（/update）注册
#include "src/ai/ai_dump.h"   // AI 抓帧留档清单/取图（/ai_dump, /ai_frame 调试用）
#include "src/ai/magnify.h"   // /zoomshot：手动对当帧目标区域裁出放大图（等价于 AI 的 zoom）
#include "src/ai/ai_client.h"   // ai::busy()：AI 任务进行中时图传 FPS 降半，让 CPU 与内部 DMA 池给 AI 让路

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#endif

// 板载人脸检测/识别已关闭：其依赖 Espressif esp-face 的模型头文件，
// 且本项目视觉识别交由云端多模态大模型完成，板载人脸检测非必需。
// 若日后需要启用：引入 espressif/esp-face 模型头文件后，将下面两宏置 1 即可。
#define CONFIG_ESP_FACE_DETECT_ENABLED 0
#define CONFIG_ESP_FACE_RECOGNITION_ENABLED 0

#if CONFIG_ESP_FACE_DETECT_ENABLED

#include <vector>
#include "human_face_detect_msr01.hpp"
#include "human_face_detect_mnp01.hpp"

#define TWO_STAGE 1 /*<! 1: detect by two-stage which is more accurate but slower(with keypoints). */
                    /*<! 0: detect by one-stage which is less accurate but faster(without keypoints). */

#if CONFIG_ESP_FACE_RECOGNITION_ENABLED
#include "face_recognition_tool.hpp"
#include "face_recognition_112_v1_s16.hpp"
#include "face_recognition_112_v1_s8.hpp"

#define QUANT_TYPE 0 //if set to 1 => very large firmware, very slow, reboots when streaming...

#define FACE_ID_SAVE_NUMBER 7
#endif

#define FACE_COLOR_WHITE 0x00FFFFFF
#define FACE_COLOR_BLACK 0x00000000
#define FACE_COLOR_RED 0x000000FF
#define FACE_COLOR_GREEN 0x0000FF00
#define FACE_COLOR_BLUE 0x00FF0000
#define FACE_COLOR_YELLOW (FACE_COLOR_RED | FACE_COLOR_GREEN)
#define FACE_COLOR_CYAN (FACE_COLOR_BLUE | FACE_COLOR_GREEN)
#define FACE_COLOR_PURPLE (FACE_COLOR_BLUE | FACE_COLOR_RED)
#endif

// Enable LED FLASH setting
#define CONFIG_LED_ILLUMINATOR_ENABLED 1

// LED FLASH setup
#if CONFIG_LED_ILLUMINATOR_ENABLED

#define CONFIG_LED_MAX_INTENSITY 255

int led_duty = 0;
bool isStreaming = false;
static uint8_t s_led_pin = 0;  // core 3.x LEDC 改引脚式 API，不再手动分 channel（与摄像头 timer 冲突由驱动内部处理）

#endif

typedef struct
{
    httpd_req_t *req;
    size_t len;
} jpg_chunking_t;

#define PART_BOUNDARY "123456789000000000000987654321"
static const char *_STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char *_STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char *_STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\nX-Timestamp: %d.%06d\r\n\r\n";

httpd_handle_t stream_httpd = NULL;
httpd_handle_t camera_httpd = NULL;

// 连接建立后关 Nagle（指令/结果小报文低延迟）。
// 图传帧已改走 UDP，WS 不再承载大帧，故发送缓冲不再放大；
// 之前 64KB 的 SO_SNDBUF 会吃掉内部 RAM 连续块，反而挤占 ai_client 的 TLS 握手堆。
static void tune_socket(int fd)
{
    int sndbuf = 8 * 1024;
    lwip_setsockopt(fd, SOL_SOCKET, SO_SNDBUF, &sndbuf, sizeof(sndbuf));
    int nodelay = 1;
    lwip_setsockopt(fd, IPPROTO_TCP, TCP_NODELAY, &nodelay, sizeof(nodelay));
}

#ifdef CONFIG_HTTPD_WS_SUPPORT
// =================== WebSocket（端口 81 根路径，手机 App WSCarClient 通道） ===================
#include "ArduinoJson.h"
#include "src/cam/camera.h"
#include "src/core/command.h"
#include "src/net/ble.h"
#include "src/ai/ai_client.h"
#include "src/exec/direct_exec.h"
#include "src/core/board_log.h"
#include "src/net/wifi_net.h"   // net::kWanMtu（UDP 分片大小由它派生）

#define WS_STREAM_FPS 10
// UDP 图传整帧上限帧率：板子按链路吞吐能推多快就推多快，但接收端解析能力有限，
// 超出部分只会变成接收端积压（延迟累积、并挤占控制面应答），故在此封顶。
#define UDP_STREAM_MAX_FPS 18
#define WS_EDIT_IMG_MAX (128 * 1024)  // 编辑图（二进制上行）上限，与 ai_client 一致

// WS 对端（手机）活体探测：连续此时间无任何上行 → 发一次探测 ping；再此时间无响应判死。
// 用于感知"静默断链"（如手机重启），恢复 BLE 广播供再次配网/兜底。探测基于应用层
// {"type":"ping"}，对端协议栈/客户端回 {"type":"pong"}，均走 WS 文本帧，无附加心跳。
// 手机侧无条件按固定周期发 ping（上行，与图传下行无关），故 idle 阈值只要大于该周期
// 就不会误伤健康客户端。⚠️ 曾误伤：手机侧一度改成"仅下行空闲时才发探测"，图传下行不断
// → 上行 ping 永不发、idle 必然到期；且单轮无应答即踢，把"手机这一拍忙"当成真断链。
static const uint32_t WS_IDLE_PING_MS = 6000;     // 连续无上行时长，达到则发探测
static const uint32_t WS_PING_TIMEOUT_MS = 2500;  // 单轮探测可容忍的无上行时长
static const uint32_t WS_PING_MAX_TRY = 3;        // 最多探测轮数，连续这么多轮无应答才判死
static volatile uint32_t s_ws_last_rx_ms = 0;      // 最近收到任一 WS 文本/binary 上行（ms）
static volatile bool s_ws_ping_pending = false;    // 已发探测、等 pong（由 httpd 任务写入）
static uint32_t s_ws_ping_at_ms = 0;
static uint32_t s_ws_ping_try = 0;                 // 本轮已发出的探测次数（判死计数）
static bool s_ws_had_client = false;               // WS 客户端曾经在位（有→无即判离线）

// httpd 活跃 fd 表上限，须 >= 服务器 max_open_sockets（给足余量，过长时跳过）
#define WS_MAX_CLIENTS 32

// =================== UDP 图传（手机 App UDPVideoClient 接收端） ===================
// 图传视频帧改用 UDP 承载，替代 WS 的 TCP 推流：规避 TCP 慢启动/Nagle/重传引发的
// 延迟时高时低。指令/状态仍走 WS（控制面，低带宽可靠通道）。
// 握手：手机绑定本地 UDP 端口并上报本机 IP，随 WS 的 stream on 指令发(udp_port, src_ip)；
// 板据此建立 UDP 会话（同网段，无 NAT）。整帧 JPEG 切成 ≤UDP_JPG_CHUNK 的分片推送。
#define UDP_FRAME_HDR 14       // 分片头固定字节：magic(2) frame_id(4) seq(2) count(2) total(4) 全大端
// 每数据报 JPEG 分片负载：网卡 MTU 扣 IP(20)+UDP(8)+分片头，保证**不会被 IP 分片**。
// 必须由 net::kWanMtu 派生，不能写死：板子为修 AI 通路把网卡 MTU 压到了公网路径 MTU 之下
// （见 wifi_net.h），此处若仍是 1500 时代的数值，每个数据报都会被切成两片 —— 图传的
// 报文数、驱动 TX 队列压力与"丢一片=废一帧"的概率都会变差。接收端按包头 seq/count 重组，
// 与分片大小无关，故改小完全兼容。
#define UDP_JPG_CHUNK (net::kWanMtu - 28 - UDP_FRAME_HDR)
#define UDP_MAGIC0 0x56
#define UDP_MAGIC1 0x44
static int s_udp_fd = -1;                    // UDP 会话 fd（懒创建）
static volatile bool s_udp_peer_valid = false; // 已注册手机 UDP 对端
static struct sockaddr_in s_udp_peer;        // 目标：手机 IP:udp_port（WS 处理任务写、推流任务读）
static uint32_t s_udp_frame_id = 0;          // 帧序号，接收端按它区分新旧帧

// 建立/更新 UDP 对端：ip_s_addr 为网络字节序、port 为主机序（内部 htons）。懒创建非阻塞 socket（缓冲满即跳帧）。
static void udp_peer_set(uint32_t ip_s_addr, uint16_t port) {
    if (s_udp_fd < 0) {
        s_udp_fd = lwip_socket(AF_INET, SOCK_DGRAM, IPPROTO_UDP);
        // 走 blog 而不是 log_e：log_e 受 CORE_DEBUG_LEVEL 管，板菜单 DebugLevel=none 时
        // 整句被编译掉（板子在车上、串口够不着，静默就等于没有）。板端 /log ws on 能看到。
        if (s_udp_fd < 0) { blog::logf(blog::WS, "UDP socket 创建失败，图传无法建立"); return; }
        // 非阻塞：拿不到发送机会就立刻返回，由 udp_pump 停手、下个 tick 接着续，不在这里等。
        // 注：lwip 的 UDP 出站不实现 SO_SNDBUF（无 socket 级发送缓冲，setsockopt 无效），
        // 背压完全来自 WiFi 驱动 TX 队列 —— sendto 返回 <0 即"队列满"，属正常节流信号。
        lwip_fcntl(s_udp_fd, F_SETFL, O_NONBLOCK);
    }
    memset(&s_udp_peer, 0, sizeof(s_udp_peer));
    s_udp_peer.sin_family = AF_INET;
    s_udp_peer.sin_addr.s_addr = ip_s_addr;
    s_udp_peer.sin_port = htons(port);
    s_udp_peer_valid = true;
}

