YangQwQ/Stm32VisionSenseCar/Stm32-Vision/src/net/app_httpd.cpp
// WS 帧发送串行化（与下面 ws_send_text / ws_send_jpeg 共用）：帧由多个任务并发发出，而
// httpd_ws_send_frame_async 是"低层直接写 socket"（帧头与载荷分次写，无内部排队、
// 无线程安全保证）。并发调用会把两个帧的字节交错，接收端只能按协议错误断链——手机端
// Godot 报的就是 1007 的 RFC 描述文本 "Invalid frame payload data"（看着像 UTF-8 问题，
// 实为帧被写坏），表现为"日志一切正常却莫名掉线"，且必在日志/状态推送最密时发作。
static SemaphoreHandle_t s_ws_tx_mtx = nullptr;
static StackType_t*  s_ws_stack = nullptr;  // ws_stream 任务栈：放 PSRAM，抬内部 DMA 块水位
static StaticTask_t  s_ws_tcb;
#define WS_TX_LOCK_TIMEOUT_MS 500   // 等锁上限：对端卡住时宁可丢这一帧，绝不拖住调用者

static esp_err_t ws_send_text(int fd, const char *text)
{
    // 统一出口消毒，堆拷贝发(1:1)，不动入参、不占发送任务大栈。缓冲走 PSRAM: 长文本
    // (AI 思考转发)可达几十 KB, 用内部堆清零一块会威胁 DMA 块红线; 短帧也不受影响。
    size_t n = strlen(text);
    char* buf = (char*)heap_caps_malloc(n + 1, MALLOC_CAP_SPIRAM);
    if (!buf) return ESP_ERR_NO_MEM;
    memcpy(buf, text, n + 1);
    ws_sanitize_utf8(buf);
    httpd_ws_frame_t frame = {0};
    frame.type = HTTPD_WS_TYPE_TEXT;
    frame.payload = (uint8_t *)buf;
    frame.len = strlen(buf);
    if (s_ws_tx_mtx && xSemaphoreTake(s_ws_tx_mtx, pdMS_TO_TICKS(WS_TX_LOCK_TIMEOUT_MS)) != pdTRUE) {
        free(buf);
        return ESP_ERR_TIMEOUT;
    }
    esp_err_t r = httpd_ws_send_frame_async(stream_httpd, fd, &frame);
    if (s_ws_tx_mtx) xSemaphoreGive(s_ws_tx_mtx);
    free(buf);
    return r;
}

static esp_err_t ws_send_jpeg(int fd, camera_fb_t *fb)
{
    httpd_ws_frame_t frame = {0};
    frame.type = HTTPD_WS_TYPE_BINARY;
    frame.payload = fb->buf;
    frame.len = cam::jpeg_len(fb);   // 勿用 fb->len：可能被驱动报大（裹进后续帧）
    if (s_ws_tx_mtx && xSemaphoreTake(s_ws_tx_mtx, pdMS_TO_TICKS(WS_TX_LOCK_TIMEOUT_MS)) != pdTRUE)
        return ESP_ERR_TIMEOUT;
    esp_err_t r = httpd_ws_send_frame_async(stream_httpd, fd, &frame);
    if (s_ws_tx_mtx) xSemaphoreGive(s_ws_tx_mtx);
    return r;
}

// cmd::Reply 适配：把应答文本发回给指定 fd。
// fd 已不是活跃 WS 客户端时回退广播：AI 闭环这类**长任务**在任务起点就把 fd 深拷贝进任务
// （见 ai_client 的 enqueue_result），手机 WS 断线重连换了 fd 之后，原 fd 不再是 WS 客户端，
// 定向发送会被 httpd 丢弃（ws_send_text 只回错误码，无人重试），手机端表现为"任务还在跑、
// 但 AI 的答复突然不再出现"（AI 调试日志走广播通道，故照常到达，容易误判成日志模块的问题）。
// 本链路假定单手机客户端，失效即广播与定向等价，消息不会再丢。
static void ws_cmd_reply(void *ctx, const char *text)
{
    int fd = *(int *)ctx;
    if (httpd_ws_get_fd_info(stream_httpd, fd) == HTTPD_WS_CLIENT_WEBSOCKET)
        ws_send_text(fd, text);
    else
        ws_send_text_to_ws_clients(text);
}

// 文本帧 = 指令 JSON；stream 就地建/拆 UDP 会话，其余统一移交 command 模块
static void ws_handle_text(const char *json, int fd)
{
    JsonDocument doc;
    if (deserializeJson(doc, json)) {
        log_w("[ws] bad json: %s", json);
        return;
    }
    const char *type = doc["type"] | "";

    // UDP 图传握手：stream on 且携带有效 udp_port → 结合 WS 对端 IP 建立 UDP 会话；
    // 其余（on 无有效端口 / off）→ 拆除旧会话，避免向已失效端口空推。
    if (!strcmp(type, "stream")) {
        bool on = doc["params"]["on"] | false;
        int port = doc["params"]["udp_port"] | 0;
        const char *src_ip = doc["params"]["src_ip"] | "";
        blog::logf(blog::WS, "stream on=%d port=%d src_ip=%s", on, port, src_ip);
        // 升级中不建/不拆 UDP 会话：手机自动重连会把"开图传"原样重放回来（掉线时它的开关
        // 并不会复位），一旦重建对端 ws_stream_task 立刻恢复抓帧推流，与固件写入抢射频和
        // core1（实测把 OTA 拖到超时）。command 侧另有同样的闸门，这里挡的是它之前的建会话。
        if (ota::active()) {
            blog::logf(blog::WS, "固件升级中：忽略图传开关（保持关闭）");
        } else if (on && port > 0) {
            struct sockaddr_in src;
            socklen_t sl = sizeof(src);
            uint32_t peer_ip = 0;
            // 优先采用手机上报的本机 IP（实测 lwip_getpeername 对 httpd fd 回 0.0.0.0，不可靠）
            if (src_ip[0]) {
                uint32_t a = 0, b = 0, c = 0, d = 0;
                // %lu 而不是 %u: 本平台上 uint32_t 就是 unsigned long(-Wall 下 %u 会报类型不符)
                if (sscanf(src_ip, "%lu.%lu.%lu.%lu", &a, &b, &c, &d) == 4)
                    peer_ip = a | (b << 8) | (c << 16) | ((uint32_t)d << 24);  // 首字节在低址 = 网络字节序
                else
                    peer_ip = 0;
            }
            if (peer_ip) {
                udp_peer_set(peer_ip, (uint16_t)port);
            } else if (lwip_getpeername(fd, (struct sockaddr *)&src, &sl) == 0) {
                udp_peer_set(src.sin_addr.s_addr, (uint16_t)port);
            }
            blog::logf(blog::WS, "peer set -> %u.%u.%u.%u:%d",
                        (uint8_t)(peer_ip), (uint8_t)(peer_ip >> 8),
                        (uint8_t)(peer_ip >> 16), (uint8_t)(peer_ip >> 24), port);
        } else {
            udp_peer_clear();
            blog::logf(blog::WS, "peer cleared (on=%d port=%d)", on, port);
        }
    }
    // 统一词表：move/stop/arm/config/stream/ai_goal/ai_cancel 等交给 command
    // （stream 由 command 更新全局图传开关；ai_goal 异步结果回传）。
    // 摇杆高频帧同指令连续重复时只记首条，避免刷屏；换指令再记。
    // has_frames=false：图传已走 UDP，WS 文本帧不内嵌 JPEG（该参数仅用于日志）。
    static String s_last_cmd;
    if (s_last_cmd != type) {
        log_i("[ws] forward to cmd: %s", type);
        s_last_cmd = type;
    }
    cmd::handle(json, false, ws_cmd_reply, &fd);
}

static esp_err_t ws_handler(httpd_req_t *req)
{
    if (req->method == HTTP_GET) {
        // 非 WS 升级的浏览器访问根路径 → 重定向到 /stream
        if (httpd_req_get_hdr_value_len(req, "Upgrade") == 0) {
            httpd_resp_set_status(req, "302 Found");
            httpd_resp_set_hdr(req, "Location", "/stream");
            httpd_resp_send(req, NULL, 0);
            return ESP_OK;
        }
        tune_socket(httpd_req_to_sockfd(req)); // WS 握手 fd，图传前先调好窗口/Nagle
        return ESP_OK; // WS 握手，101 由 httpd 自动完成
    }

    httpd_ws_frame_t pkt = {0};
    pkt.type = HTTPD_WS_TYPE_TEXT;
    esp_err_t ret = httpd_ws_recv_frame(req, &pkt, 0);
    if (ret != ESP_OK) return ret;
    if (pkt.len == 0) return ESP_OK;
    s_ws_last_rx_ms = (uint32_t)(esp_timer_get_time() / 1000);  // 任何上行都视为有活动，续活判定准
    s_ws_ping_pending = false;                                   // 收到上行即撤销探测等待，防误杀

    // 二进制帧 = 编辑图（裸 JPEG，手机→板）：覆盖暂存供 ai_goal{use_image}消费。
    if (pkt.type == HTTPD_WS_TYPE_BINARY) {
        if (pkt.len > WS_EDIT_IMG_MAX) return ESP_FAIL;  // 超大帧，断开
        char *ibuf = (char *)malloc(pkt.len);
        if (!ibuf) return ESP_ERR_NO_MEM;
        pkt.payload = (uint8_t *)ibuf;
        ret = httpd_ws_recv_frame(req, &pkt, pkt.len);
        if (ret == ESP_OK && pkt.type == HTTPD_WS_TYPE_BINARY) {
            ai::set_edited_image((uint8_t *)ibuf, pkt.len);
        }
        free(ibuf);
        return ret;
    }

    // 文本帧 = 指令 JSON（≤512B，异常长帧断开）
    if (pkt.len > 512) return ESP_FAIL;
    char *buf = (char *)malloc(pkt.len + 1);
    if (!buf) return ESP_ERR_NO_MEM;
    pkt.payload = (uint8_t *)buf;
    ret = httpd_ws_recv_frame(req, &pkt, pkt.len);
    if (ret == ESP_OK && pkt.type == HTTPD_WS_TYPE_TEXT) {
        buf[pkt.len] = 0;
        ws_handle_text(buf, httpd_req_to_sockfd(req));
    }
    free(buf);
    return ret;
}

// core 3.x / IDF 无 httpd_ws_client_iterate：改由 httpd_get_client_list 取全部活跃
// fd，再用 httpd_ws_get_fd_info 筛出 WEBSOCKET 会话（HTTP 会话不计入）。

