YangQwQ/Stm32VisionSenseCar/Stm32-Vision/src/net/app_httpd.cpp
static bool ws_send_jpeg_to_ws_clients(camera_fb_t *fb, bool *has_client)
{
    bool any = false;
    int fds[WS_MAX_CLIENTS];
    size_t n = WS_MAX_CLIENTS;
    if (httpd_get_client_list(stream_httpd, &n, fds) != ESP_OK) return false;
    for (size_t i = 0; i < n; i++) {
        if (httpd_ws_get_fd_info(stream_httpd, fds[i]) != HTTPD_WS_CLIENT_WEBSOCKET) continue;
        any = true;
        if (has_client) *has_client = true;
        if (fb) ws_send_jpeg(fds[i], fb);
    }
    return any;
}

// 文本广播给全部 WS 客户端（本直驱状态推送，async 安全）。
static void ws_send_text_to_ws_clients(const char *text)
{
    int fds[WS_MAX_CLIENTS];
    size_t n = WS_MAX_CLIENTS;
    if (httpd_get_client_list(stream_httpd, &n, fds) != ESP_OK) return;
    for (size_t i = 0; i < n; i++) {
        if (httpd_ws_get_fd_info(stream_httpd, fds[i]) != HTTPD_WS_CLIENT_WEBSOCKET) continue;
        ws_send_text(fds[i], text);
    }
}

// 统一日志模块的转发器：WS 广播 + BLE status 通知（在 blog 转发任务线程执行）。
// 由 startCameraServer 注册，供 blog::logf 排队后统一发手机。
static void send_log_to_phone(const char *json)
{
    ws_send_text_to_ws_clients(json);
    // 长文本(如 AI 思考转发)单一 JSON 可达几十 KB, BLE 分片 notify 无意义且阻塞转发任务,
    // 只在短文本(常规日志/状态)时走 BLE 兜底。
    if (strlen(json) <= 512) ble::send_status(json);
}

// 图传推流任务：stream 开启时按帧率向所有 WS 客户端推 JPEG 帧；
// 同时探测 WS 客户端存在性喂给 ble::set_ws_connected（status.ws），并做对端活体探测：
// 连续 WS_IDLE_PING_MS 无上行 → 发探测 ping；再 WS_PING_TIMEOUT_MS 无任意上行 → 判死，
// 踢掉全部 WS fd 并恢复 BLE 广播（供再次配网/兜底）。assume 单手机客户端（全局 last_rx）。
static void ws_stream_task(void *arg)
{
    while (true) {
        bool has_client = false;
        // WS 客户端在位探测：必须每个 tick 无条件执行。它是 has_client 的唯一来源，
        // 而 has_client 既喂 ble::set_ws_connected，又决定下面「客户端离线」的判定。
        // ⚠️ 曾经只在"抓到新帧"分支里探测：续传跨 tick 那几拍 has_client 恒为 false，
        // 于是刚开播就被判成客户端离线 → 停推流 + 清 UDP 对端（画面卡在首帧、连接显示掉线）。
        ws_send_jpeg_to_ws_clients(nullptr, &has_client);

        // 升级中一律走"停推流"分支：闸门在 command/ws_handle_text 已挡住重新开启，这里兜底，
        // 顺带把在途帧的 PSRAM 副本放掉，把内存与 core1 让给固件写入。
        if (cmd::streaming() && !ota::active()) {
            if (s_out_active) {
                udp_pump();              // 上一帧还在续传：按队列空闲续片，不抢新帧
                // 弃帧只针对"发不动"：链路彻底不消化(持续一段时间一片都没出去)，
                // 或单帧拖太久(超过在途上限，画面已陈旧到没意义)。慢链路只要有进展就不会被弃——
                // 帧率自适应到吞吐，而不是把帧丢一半。
                uint64_t now_us = esp_timer_get_time();
                bool stall    = (now_us - s_out_last_ok > OUT_FRAME_STALL_US);
                bool overtime = (now_us - s_out_start   > OUT_FRAME_MAX_US);
                if (s_out_active && (stall || overtime)) {
                    // 必须打印命中的是哪条判据：超时弃帧时"无进展"往往远小于其阈值(400ms)，
                    // 只印它会把排查方向带偏（曾据此误判链路无进展）。
                    blog::logf(blog::WS, "[udp] 弃帧 fid=%u seq=%u/%u len=%u 判据=%s 无进展=%dms 在途=%dms errno=%d 失败=%u",
                               s_out_fid, s_out_seq_next, s_out_count, (unsigned)s_out_len,
                               stall ? "无进展" : "在途超时",
                               (int)((now_us - s_out_last_ok) / 1000),
                               (int)((now_us - s_out_start) / 1000),
                               s_out_errno, (unsigned)s_out_fail);
                    s_out_active = false;
                }
            } else {
                uint64_t grab_us = esp_timer_get_time();
                // 上限帧率：整帧间隔不小于 1/max_fps。不封顶则"链路能推多快推多快"，接收端吃不下只会
                // 积压成延迟，反过来挤占控制面（pong 应答）的时序。
                // AI 任务进行中降到一半 FPS：高帧推流压 CPU + 碎内部 DMA 池（TX pbuf 与 RX 同池互抢），
                // 实测开着图传会让 DMA 块告警连发、并发 AI 被拖慢；降帧把两条都让给 AI。
                int max_fps = ai::busy() ? (UDP_STREAM_MAX_FPS / 2) : UDP_STREAM_MAX_FPS;
                if (grab_us - s_out_last_grab_us >= (1000000ULL / max_fps)) {
                    camera_fb_t *fb = cam::grab();    // 图传高频：直接抓帧，拷入 PSRAM 后立刻还缓冲
                    if (fb) {
                        s_out_last_grab_us = grab_us;
                        size_t flen = cam::jpeg_len(fb);   // 勿用 fb->len：虚高会把后续帧当本帧推出去
                        bool started = udp_start_frame(fb->buf, flen);
                        cam::return_frame(fb);
                        if (started) udp_pump();
                    }
                }
            }
        } else {
            // 停推流：中断在途帧并释放 PSRAM 帧副本（下次开播重新分配）
            s_out_active = false;
            udp_out_free();
        }

        uint32_t now = (uint32_t)(esp_timer_get_time() / 1000);
        if (has_client) {
            if (s_ws_last_rx_ms == 0) s_ws_last_rx_ms = now;  // 首个挂上的时刻作为 idle 起点
            if (!s_ws_ping_pending && (int32_t)(now - s_ws_last_rx_ms) >= (int32_t)WS_IDLE_PING_MS) {
                s_ws_ping_pending = true;
                s_ws_ping_at_ms = now;
                s_ws_ping_try = 1;
                ws_ping_all();
                blog::logf(blog::WS, "idle 超时，发探测 ping (#%u)", (unsigned)s_ws_ping_try);
            } else if (s_ws_ping_pending &&
                       (int32_t)(now - s_ws_ping_at_ms) >= (int32_t)WS_PING_TIMEOUT_MS) {
                // 单轮无应答不立刻判死：手机主线程可能只是这一拍被图传解码占住（同步解码、
                // 与 WS 读包同线程），重发一轮给它机会；连续多轮都没上行才认定真断。
                if (s_ws_ping_try >= WS_PING_MAX_TRY) {
                    // 判死：踢 fd，下轮 has_client 回落 → 尾部恢复广播
                    s_ws_ping_pending = false;
                    s_ws_ping_try = 0;
                    s_ws_last_rx_ms = 0;
                    has_client = false;
                    ws_kick_all();
                    blog::logf(blog::WS, "探测 %u 轮无应答，判定断线，恢复广播", (unsigned)WS_PING_MAX_TRY);
                } else {
                    s_ws_ping_at_ms = now;
                    s_ws_ping_try++;
                    ws_ping_all();
                    blog::logf(blog::WS, "探测无应答，重发 ping (#%u/%u)",
                               (unsigned)s_ws_ping_try, (unsigned)WS_PING_MAX_TRY);
                }
            }
        } else {
            s_ws_ping_pending = false;  // 无 WS 挂载时复位探测态
            s_ws_ping_try = 0;
        }

        // 客户端从有到无（手机退出且未先发 stream off）：停掉它发起的推流，
        // 否则 ws 任务持续白抓帧，BLE 广播也无机会恢复。
        if (has_client) {
            s_ws_had_client = true;
        } else if (s_ws_had_client) {
            s_ws_had_client = false;
            cmd::set_streaming(false);
            udp_peer_clear();  // WS 会话失效，随普通图传一起停掉 UDP 对端
            blog::logf(blog::WS, "客户端离线，停止推流");
        }

        ble::set_ws_connected(has_client);
        // 本地直驱状态 → 手机（/log exec on 开启时实时推送；替代原执行板上行帧镜像）。
        // 不依赖 WS 客户端在位：纯蓝牙（WS 未连）时经 BLE status 通知也可直达手机。
        // 默认关：空闲不刷屏。开启后约 400ms 推一条 exec::read_state 合成的状态文本；
        // 状态文本与上次完全相同时跳过（防刷屏，只有变化才推）。
        static uint32_t s_last_status_ms = 0;
        static char s_last_state[192] = {0};
        // OTA 升级期间停推周期状态：每 400ms 一条 WS+BLE 通知纯属抢射频的杂音
        if (!ota::active() && blog::enabled(blog::EXEC) &&
            (int32_t)(now - s_last_status_ms) >= (int32_t)400) {
            s_last_status_ms = now;
            char st[256];  // 状态含抓手前端 XZ 与 PWM + 撞边界/位姿没到位诊断，需足量避免截断
            if (exec::read_state(st, sizeof(st)) && strcmp(st, s_last_state)) {
                strncpy(s_last_state, st, sizeof(s_last_state) - 1);
                s_last_state[sizeof(s_last_state) - 1] = 0;
                JsonDocument sdoc;
                sdoc["type"] = "exec_status";
                JsonObject sp = sdoc["params"].to<JsonObject>();
                sp["text"] = st;
                String js;
                serializeJson(sdoc, js);
                if (has_client) ws_send_text_to_ws_clients(js.c_str());
                ble::send_status(js.c_str());
            }
        }
        // 图传已改走 UDP：WS 客户端在位仅作指令/状态通道，几乎不占射频；
        // 只有"真在推帧"（UDP 图传 / MJPEG 推流）才停 BLE 广播，否则手机随时可发现
        // VisionS3 重连（此前 WS 常挂/半开会让广播永久关闭，导致手机不重启连不上）。
        ble::set_transmission(isStreaming || cmd::streaming());
        // 空转降频：无 WS 客户端且非推流时，此任务只需维持 BLE 广播/心跳探测，无需高频轮询。
        // 降低空转 CPU，让 core1 让给图传/AI。
        // 推流中用短节拍：udp_pump 已按驱动队列排空速度自行限流，这里只需尽快回到 pump；
        // 若仍用 100ms 长节拍，吞吐会再被钉在「驱动队列容量 × 10Hz」上（见 udp_pump 注释）。
        if (cmd::streaming())
            vTaskDelay(pdMS_TO_TICKS(OUT_PUMP_TICK_MS));
        else if (has_client)
            vTaskDelay(pdMS_TO_TICKS(1000 / WS_STREAM_FPS));
        else
            vTaskDelay(pdMS_TO_TICKS(500));
    }
}
#endif // CONFIG_HTTPD_WS_SUPPORT

#if CONFIG_ESP_FACE_DETECT_ENABLED

