YangQwQ/Stm32VisionSenseCar/Stm32-Vision/src/net/app_httpd.cpp
// /zoomshot: 对当帧按目标区域裁出放大 JPEG —— 手动"凑近看"两指与目标，等价于 AI 的 zoom。
// 参数(GET query)：px,py=框中心(归一化 0~1，默认 0.5)；scale=倍率(框=全幅 1/scale，默认 2，上限 8)；
// out_w/out_h=输出尺寸(像素，默认 640×480)；quality=JPEG 质量(默认 80)。
static esp_err_t zoomshot_handler(httpd_req_t *req)
{
    // request_hires(库正规切换路径)：reconfigure 重开 SVGA 高清 → 抓整幅高清帧 → 回 VGA，全程持锁。
    // ⚠️ 用 SVGA(800×600) 而非 SXGA：SXGA(1280×960) 的 esp_camera_init 重建会把板子卡死(实测, 与
    // TJpgDec 无关, 卡在驱动层)，SVGA 已验证 reconfigure 稳定。
    // 高清帧用 TJpgDec 部分解码只取中央 (0.25,0.25)-(0.75,0.75) 并重编码回传 —— workbuf/RGB 全走 PSRAM，
    // 不碰内部堆/DMA，规避"切分辨率缓冲溢出"与"软解整幅吃内部 RAM"两道卡死。
    int hok = 0;
    camera_fb_t *fb = cam::request_hires(FRAMESIZE_SVGA, &hok);
    if (!fb || !hok) { if (fb) cam::return_frame(fb); httpd_resp_send_500(req); return ESP_FAIL; }
    const size_t w = fb->width, h = fb->height;
    int outw = 640, outh = 480, quality = 80;
    char qs[160];
    if (httpd_req_get_url_query_str(req, qs, sizeof(qs)) == ESP_OK) {
        char p[16];
        if (httpd_query_key_value(qs, "out_w", p, sizeof(p)) == ESP_OK) { outw = atoi(p); if (outw <= 0 || outw > 4096) outw = 640; }
        if (httpd_query_key_value(qs, "out_h", p, sizeof(p)) == ESP_OK) { outh = atoi(p); if (outh <= 0 || outh > 4096) outh = 480; }
        if (httpd_query_key_value(qs, "quality", p, sizeof(p)) == ESP_OK) { quality = atoi(p); if (quality < 1 || quality > 100) quality = 80; }
    }
    size_t cap = (size_t)outw * outh + 1024;
    uint8_t *out = (uint8_t *)heap_caps_malloc(cap, MALLOC_CAP_SPIRAM);
    if (!out) { cam::return_frame(fb); httpd_resp_send_500(req); return ESP_FAIL; }
    size_t olen = 0;
    bool ok = magnify::crop_center_jpg(fb->buf, cam::jpeg_len(fb), (int)w, (int)h,
                                       out, cap, &olen, outw, outh, quality);
    cam::return_frame(fb);   // 高清帧用完归还（锁已在 request_hires 内部放）
    if (!ok || olen == 0) { heap_caps_free(out); httpd_resp_send_500(req); return ESP_FAIL; }
    httpd_resp_set_type(req, "image/jpeg");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    esp_err_t res = httpd_resp_send(req, (const char *)out, (int)olen);
    heap_caps_free(out);
    return res;
}

static esp_err_t capture_handler(httpd_req_t *req)
{
    camera_fb_t *fb = NULL;
    esp_err_t res = ESP_OK;
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
    int64_t fr_start = esp_timer_get_time();
#endif

#if CONFIG_LED_ILLUMINATOR_ENABLED
    enable_led(true);
    vTaskDelay(150 / portTICK_PERIOD_MS); // The LED needs to be turned on ~150ms before the call to esp_camera_fb_get()
    fb = cam::grab();             // or it won't be visible in the frame. A better way to do this is needed.
    enable_led(false);
#else
    fb = cam::grab();
#endif

    if (!fb)
    {
        log_e("Camera capture failed");
        httpd_resp_send_500(req);
        return ESP_FAIL;
    }

    httpd_resp_set_type(req, "image/jpeg");
    httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.jpg");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

    char ts[32];
    // tv_sec 是 time_t(64 位)而 long 只有 32 位: 用 %ld 读 64 位实参在 2038 前"碰巧"对,
    // 属真 bug 而非风格问题(编译器在 -Wall 下会点出来)。
    snprintf(ts, 32, "%lld.%06ld", (long long)fb->timestamp.tv_sec, (long)fb->timestamp.tv_usec);
    httpd_resp_set_hdr(req, "X-Timestamp", (const char *)ts);

    // X-Raw-Len = 驱动自己报的 fb->len（**未**经 jpeg_len 校正）。正文只发校正后的真实长度，
    // 于是"驱动是否还在把多帧拼进一格"从正文里就看不出来了 —— 拿它跟本次实际发出的字节数一比
    // 即可判定（不等即驱动侧拼帧，差值就是被截掉的尾巴）。诊断用，别当数据用。
    char raw[24];
    snprintf(raw, sizeof(raw), "%u", (unsigned)fb->len);
    httpd_resp_set_hdr(req, "X-Raw-Len", (const char *)raw);

#if CONFIG_ESP_FACE_DETECT_ENABLED
    size_t out_len, out_width, out_height;
    uint8_t *out_buf;
    bool s;
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
    bool detected = false;
#endif
    int face_id = 0;
    if (!detection_enabled || fb->width > 400)
    {
#endif
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
        size_t fb_len = 0;
#endif
        if (fb->format == PIXFORMAT_JPEG)
        {
            // 勿用 fb->len：驱动可能报大（缓冲里裹了后续帧），发出去就是"一张图带尾巴"
            size_t jlen = cam::jpeg_len(fb);
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
            fb_len = jlen;
#endif
            res = httpd_resp_send(req, (const char *)fb->buf, jlen);
        }
        else
        {
            jpg_chunking_t jchunk = {req, 0};
            res = frame2jpg_cb(fb, 80, jpg_encode_stream, &jchunk) ? ESP_OK : ESP_FAIL;
            httpd_resp_send_chunk(req, NULL, 0);
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
            fb_len = jchunk.len;
#endif
        }
        esp_camera_fb_return(fb);
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
        int64_t fr_end = esp_timer_get_time();
#endif
        log_i("JPG: %uB %ums", (uint32_t)(fb_len), (uint32_t)((fr_end - fr_start) / 1000));
        return res;
#if CONFIG_ESP_FACE_DETECT_ENABLED
    }

    jpg_chunking_t jchunk = {req, 0};

    if (fb->format == PIXFORMAT_RGB565
#if CONFIG_ESP_FACE_RECOGNITION_ENABLED
     && !recognition_enabled
#endif
     ){
#if TWO_STAGE
        HumanFaceDetectMSR01 s1(0.1F, 0.5F, 10, 0.2F);
        HumanFaceDetectMNP01 s2(0.5F, 0.3F, 5);
        std::list<dl::detect::result_t> &candidates = s1.infer((uint16_t *)fb->buf, {(int)fb->height, (int)fb->width, 3});
        std::list<dl::detect::result_t> &results = s2.infer((uint16_t *)fb->buf, {(int)fb->height, (int)fb->width, 3}, candidates);
#else
        HumanFaceDetectMSR01 s1(0.3F, 0.5F, 10, 0.2F);
        std::list<dl::detect::result_t> &results = s1.infer((uint16_t *)fb->buf, {(int)fb->height, (int)fb->width, 3});
#endif
        if (results.size() > 0) {
            fb_data_t rfb;
            rfb.width = fb->width;
            rfb.height = fb->height;
            rfb.data = fb->buf;
            rfb.bytes_per_pixel = 2;
            rfb.format = FB_RGB565;
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
            detected = true;
#endif
            draw_face_boxes(&rfb, &results, face_id);
        }
        s = fmt2jpg_cb(fb->buf, fb->len, fb->width, fb->height, PIXFORMAT_RGB565, 90, jpg_encode_stream, &jchunk);
        esp_camera_fb_return(fb);
    } else
    {
        out_len = fb->width * fb->height * 3;
        out_width = fb->width;
        out_height = fb->height;
        out_buf = (uint8_t*)malloc(out_len);
        if (!out_buf) {
            log_e("out_buf malloc failed");
            httpd_resp_send_500(req);
            return ESP_FAIL;
        }
        s = fmt2rgb888(fb->buf, fb->len, fb->format, out_buf);
        esp_camera_fb_return(fb);
        if (!s) {
            free(out_buf);
            log_e("To rgb888 failed");
            httpd_resp_send_500(req);
            return ESP_FAIL;
        }

        fb_data_t rfb;
        rfb.width = out_width;
        rfb.height = out_height;
        rfb.data = out_buf;
        rfb.bytes_per_pixel = 3;
        rfb.format = FB_BGR888;

