YangQwQ/Stm32VisionSenseCar/Stm32-Vision/src/net/app_httpd.cpp
#if TWO_STAGE
                            std::list<dl::detect::result_t> &candidates = s1.infer((uint8_t *)out_buf, {(int)out_height, (int)out_width, 3});
                            std::list<dl::detect::result_t> &results = s2.infer((uint8_t *)out_buf, {(int)out_height, (int)out_width, 3}, candidates);
#else
                            std::list<dl::detect::result_t> &results = s1.infer((uint8_t *)out_buf, {(int)out_height, (int)out_width, 3});
#endif

#if CONFIG_ESP_FACE_DETECT_ENABLED && ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
                            fr_face = esp_timer_get_time();
                            fr_recognize = fr_face;
#endif

                            if (results.size() > 0) {
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
                                detected = true;
#endif
#if CONFIG_ESP_FACE_RECOGNITION_ENABLED
                                if (recognition_enabled) {
                                    face_id = run_face_recognition(&rfb, &results);
    #if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
                                    fr_recognize = esp_timer_get_time();
    #endif
                                }
#endif
                                draw_face_boxes(&rfb, &results, face_id);
                            }
                            s = fmt2jpg(out_buf, out_len, out_width, out_height, PIXFORMAT_RGB888, 90, &_jpg_buf, &_jpg_buf_len);
                            free(out_buf);
                            if (!s) {
                                log_e("fmt2jpg failed");
                                res = ESP_FAIL;
                            }
#if CONFIG_ESP_FACE_DETECT_ENABLED && ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
                            fr_encode = esp_timer_get_time();
#endif
                        }
                    }
                }
            }
#endif
        }
        if (res == ESP_OK)
        {
            res = httpd_resp_send_chunk(req, _STREAM_BOUNDARY, strlen(_STREAM_BOUNDARY));
        }
        if (res == ESP_OK)
        {
            size_t hlen = snprintf((char *)part_buf, 128, _STREAM_PART, _jpg_buf_len, _timestamp.tv_sec, _timestamp.tv_usec);
            res = httpd_resp_send_chunk(req, (const char *)part_buf, hlen);
        }
        if (res == ESP_OK)
        {
            res = httpd_resp_send_chunk(req, (const char *)_jpg_buf, _jpg_buf_len);
        }
        if (fb)
        {
            esp_camera_fb_return(fb);
            fb = NULL;
            _jpg_buf = NULL;
        }
        else if (_jpg_buf)
        {
            free(_jpg_buf);
            _jpg_buf = NULL;
        }
        if (res != ESP_OK)
        {
            log_e("Send frame failed");
            break;
        }
        int64_t fr_end = esp_timer_get_time();

#if CONFIG_ESP_FACE_DETECT_ENABLED && ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
        int64_t ready_time = (fr_ready - fr_start) / 1000;
        int64_t face_time = (fr_face - fr_ready) / 1000;
        int64_t recognize_time = (fr_recognize - fr_face) / 1000;
        int64_t encode_time = (fr_encode - fr_recognize) / 1000;
        int64_t process_time = (fr_encode - fr_start) / 1000;
#endif

        int64_t frame_time = fr_end - last_frame;
        frame_time /= 1000;
        last_frame = fr_end;  // 修复：原未更新，fps 恒为 0.0
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
        uint32_t avg_frame_time = ra_filter_run(&ra_filter, frame_time);
#endif
        log_i("MJPG: %uB %ums (%.1ffps), AVG: %ums (%.1ffps)"
#if CONFIG_ESP_FACE_DETECT_ENABLED
                      ", %u+%u+%u+%u=%u %s%d"
#endif
                 ,
                 (uint32_t)(_jpg_buf_len),
                 (uint32_t)frame_time, 1000.0 / (uint32_t)frame_time,
                 avg_frame_time, 1000.0 / avg_frame_time
#if CONFIG_ESP_FACE_DETECT_ENABLED
                 ,
                 (uint32_t)ready_time, (uint32_t)face_time, (uint32_t)recognize_time, (uint32_t)encode_time, (uint32_t)process_time,
                 (detected) ? "DETECTED " : "", face_id
#endif
        );
    }

#if CONFIG_LED_ILLUMINATOR_ENABLED
    isStreaming = false;
    enable_led(false);
#endif

    return res;
}

static esp_err_t parse_get(httpd_req_t *req, char **obuf)
{
    char *buf = NULL;
    size_t buf_len = 0;

    buf_len = httpd_req_get_url_query_len(req) + 1;
    if (buf_len > 1) {
        buf = (char *)malloc(buf_len);
        if (!buf) {
            httpd_resp_send_500(req);
            return ESP_FAIL;
        }
        if (httpd_req_get_url_query_str(req, buf, buf_len) == ESP_OK) {
            *obuf = buf;
            return ESP_OK;
        }
        free(buf);
    }
    httpd_resp_send_404(req);
    return ESP_FAIL;
}

// ── AI 抓帧留档（调试用，见 ai_dump.h）──────────────────────────────────────
// /ai_dump         → JSON 清单：这一轮 AI 收到的是哪张图、它据此做了什么（含被闸门拒的原因）
// /ai_dump?after=N → 长轮询：挂住不返回，等出现序号 >N 的定案帧就立刻回清单（最多等 AI_DUMP_FOLLOW_MS）
// /ai_frame?seq=N  → 该轮的原始 JPEG（就是发往云端的那份字节）
// 只在 `/log ai on` 期间有内容：留档由 AI worker 按 blog 开关驱动，关着时不占一个字节。
//
// 为什么要长轮询：抓取端若靠定时轮询，快了空转、慢了漏帧（环形只 6 槽，一轮 AI 约 2s，十几秒的
// 卡顿就挤掉了）。挂住请求=把"什么时候有"交给板端说，抓取端不必猜周期，也不会有轮询间隙。
// 代价只在这条 HTTP 会话自己的任务里：不碰 WS/UDP，AI 线程也不为调试工具多等一毫秒。
#define AI_DUMP_FOLLOW_MS 15000      // 单次挂起上限（抓取端的读超时必须大于它）
#define AI_DUMP_FOLLOW_TICK_MS 200   // 检查间隔 ≈ "定案 → 抓取端看见" 的延迟

static esp_err_t ai_dump_handler(httpd_req_t *req)
{
    // after=N → 长轮询模式。缺参则立即回（抓取端取历史/老用法）。
    uint32_t after = 0;
    bool follow = false;
    char q[64];
    size_t ql = httpd_req_get_url_query_len(req);
    if (ql > 0 && ql + 1 <= sizeof(q) && httpd_req_get_url_query_str(req, q, sizeof(q)) == ESP_OK) {
        char v[16];
        if (httpd_query_key_value(q, "after", v, sizeof(v)) == ESP_OK) {
            after = (uint32_t)strtoul(v, NULL, 10);
            follow = true;
        }
    }
    if (follow) {
        uint32_t t0 = (uint32_t)millis();
        while ((uint32_t)(millis() - t0) < AI_DUMP_FOLLOW_MS) {
            if (ai::dump_newest_seq() > after) break;               // 有新定案帧：立刻回
            // 留档关着 / 正在升级固件：不会再产出新帧，挂着只是白占一条会话（也给抓取端一个即时答复，
            // 好让它把"板端没在留档"这句话说出口，而不是干等 15 秒）。
            if (!blog::enabled(blog::AI) || ota::active()) break;
            vTaskDelay(pdMS_TO_TICKS(AI_DUMP_FOLLOW_TICK_MS));
        }
    }
    // 每条 ~180 字节 × 槽数；堆上开（httpd 栈 8192，清单虽小也别占它），
    // 且不能 static —— httpd 多请求并发，静态缓冲会被另一个请求盖掉。
    // 放在等待之后申请：挂起期间不占堆（AI 链路的内部堆很紧张，见 ai_client 顶部注释）。
    const size_t cap = 2048;
    char *buf = (char *)malloc(cap);
    if (!buf) {
        httpd_resp_send_500(req);
        return ESP_FAIL;
    }
    ai::dump_manifest(buf, cap);   // 失败也回合法空清单，前端不必区分错误形状
    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    httpd_resp_set_hdr(req, "Cache-Control", "no-store");
    esp_err_t r = httpd_resp_send(req, buf, HTTPD_RESP_USE_STRLEN);
    free(buf);
    return r;
}

