YangQwQ/Stm32VisionSenseCar/Stm32-Vision/src/net/app_httpd.cpp
static esp_err_t ai_frame_handler(httpd_req_t *req)
{
    uint32_t seq = 0;
    char q[64];
    if (httpd_req_get_url_query_len(req) + 1 <= sizeof(q) &&
        httpd_req_get_url_query_len(req) > 0 &&
        httpd_req_get_url_query_str(req, q, sizeof(q)) == ESP_OK) {
        char v[16];
        if (httpd_query_key_value(q, "seq", v, sizeof(v)) == ESP_OK) seq = (uint32_t)strtoul(v, NULL, 10);
    }
    if (seq == 0) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "need seq (see /ai_dump)");
        return ESP_FAIL;
    }
    // 接收缓冲走 PSRAM：单帧可达 96KB，与相机缓冲同池，不挤内部堆。
    uint8_t *buf = (uint8_t *)heap_caps_malloc(AI_DUMP_FRAME_MAX, MALLOC_CAP_SPIRAM);
    if (!buf) {
        httpd_resp_send_500(req);
        return ESP_FAIL;
    }
    uint32_t ms = 0;
    size_t n = ai::dump_copy(seq, buf, AI_DUMP_FRAME_MAX, &ms);
    if (n == 0) {
        free(buf);
        httpd_resp_send_err(req, HTTPD_404_NOT_FOUND, "no such seq (or 0-byte frame)");
        return ESP_FAIL;
    }
    char hdr[48];
    snprintf(hdr, sizeof(hdr), "seq=%u ms=%u", (unsigned)seq, (unsigned)ms);
    httpd_resp_set_type(req, "image/jpeg");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    httpd_resp_set_hdr(req, "Cache-Control", "no-store");
    httpd_resp_set_hdr(req, "X-AiFrame", hdr);
    esp_err_t r = httpd_resp_send(req, (const char *)buf, n);
    free(buf);
    return r;
}

// ── panic 现场读取（/coredump）──────────────────────────────────────────────
// 为什么需要这条路：板子跑挂后网络同时没了、串口也不在手边（车架在车上），于是「复位=崩溃」
// 四个字就是全部线索。panic 的现场其实**已经**落在 coredump 分区里（partitions.csv 里那 512KB +
// CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y），但分区开了却没有读取通路，等于没有。
// 这条 GET 把它变成能远程取回的东西：
//   GET /coredump          → 文本：panic 原因串 + 崩在哪个任务 + PC + 回溯 PC 数组 + 固件 sha
//   GET /coredump?erase=1  → 清掉现场（panic 一次覆写一次；想留旧的先取再清）
// 拿到 bt 的 PC 后，在 PC 侧对**本次固件的 .elf** 做 addr2line 即得文件:行号。先核对回来的 sha
// 与手头 .elf 的 sha256 是否一致，否则解出来的是别人的代码。工具：`carctl.py coredump`。
// ⚠️ 依赖 CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH + DATA_FORMAT_ELF；库与头文件两侧都得开
// （已在 librebuild 的配置里核实一致），否则下面两个符号链接不上——那是响亮的失败，不是静默。
static esp_err_t coredump_handler(httpd_req_t *req)
{
    // erase=1：取完现场顺手清掉，免得下次 panic 的新现场跟旧的混在一起看。
    char q[32];
    size_t ql = httpd_req_get_url_query_len(req);
    if (ql > 0 && ql + 1 <= sizeof(q) && httpd_req_get_url_query_str(req, q, sizeof(q)) == ESP_OK) {
        char v[8];
        if (httpd_query_key_value(q, "erase", v, sizeof(v)) == ESP_OK && v[0] == '1') {
            esp_err_t e = esp_core_dump_image_erase();
            char m[48];
            snprintf(m, sizeof(m), "erase=%d\n", (int)e);
            httpd_resp_set_type(req, "text/plain");
            return httpd_resp_send(req, m, HTTPD_RESP_USE_STRLEN);
        }
    }

    // summary 结构 ~200 字节、reason 上限 256：都走堆。httpd 栈只有 8192 且已知偏紧
    // （见 startCameraServer 里那条注释），不能在这条链上加大局部变量。
    const size_t cap = 1024;
    esp_core_dump_summary_t *sum = (esp_core_dump_summary_t *)malloc(sizeof(esp_core_dump_summary_t));
    char *reason = (char *)malloc(256);
    char *out = (char *)malloc(cap);
    if (!sum || !reason || !out) {
        free(sum); free(reason); free(out);
        httpd_resp_send_500(req);
        return ESP_FAIL;
    }
    reason[0] = '\0';
    esp_err_t er = esp_core_dump_get_panic_reason(reason, 256);
    esp_err_t es = esp_core_dump_get_summary(sum);

    // reason 是 panic 处理器写的自由文本，可能带引号/换行；这里按行输出，把控制字符压成空格，
    // 免得一条乱字符把整段可读性毁掉（也让 PC 侧按行切片就够，不必上 JSON 转义）。
    for (char *p = reason; *p; p++)
        if ((unsigned char)*p < 0x20) *p = ' ';

    size_t n = 0;
#define CD_ADD(...) do { \
        if (n < cap) { int w = snprintf(out + n, cap - n, __VA_ARGS__); \
                       if (w > 0) n += (size_t)w; if (n > cap) n = cap; } \
    } while (0)
    CD_ADD("ok=%d\n", (int)(es == ESP_OK));
    CD_ADD("reason_err=%d\n", (int)er);
    CD_ADD("reason=%s\n", reason);
    if (es == ESP_OK) {
        CD_ADD("task=%s\n", sum->exc_task);
        CD_ADD("pc=0x%08x\n", (unsigned)sum->exc_pc);
        CD_ADD("cause=%u vaddr=0x%08x\n",
               (unsigned)sum->ex_info.exc_cause, (unsigned)sum->ex_info.exc_vaddr);
        CD_ADD("depth=%u corrupted=%d\n",
               (unsigned)sum->exc_bt_info.depth, (int)sum->exc_bt_info.corrupted);
        CD_ADD("bt=");
        for (uint32_t i = 0; i < sum->exc_bt_info.depth && i < 16; i++)
            CD_ADD("0x%08x ", (unsigned)sum->exc_bt_info.bt[i]);
        CD_ADD("\n");
        CD_ADD("sha=%s\n", (const char *)sum->app_elf_sha256);
    } else {
        CD_ADD("summary_err=%d\n", (int)es);
    }
#undef CD_ADD

    httpd_resp_set_type(req, "text/plain");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    httpd_resp_set_hdr(req, "Cache-Control", "no-store");
    esp_err_t r = httpd_resp_send(req, out, n);
    free(sum); free(reason); free(out);
    return r;
}

static esp_err_t cmd_handler(httpd_req_t *req)
{
    char *buf = NULL;
    char variable[32];
    char value[32];

    if (parse_get(req, &buf) != ESP_OK) {
        return ESP_FAIL;
    }
    if (httpd_query_key_value(buf, "var", variable, sizeof(variable)) != ESP_OK ||
        httpd_query_key_value(buf, "val", value, sizeof(value)) != ESP_OK) {
        free(buf);
        httpd_resp_send_404(req);
        return ESP_FAIL;
    }
    free(buf);

    int val = atoi(value);
    log_i("%s = %d", variable, val);
    sensor_t *s = esp_camera_sensor_get();
    int res = 0;

    if (!strcmp(variable, "framesize")) {
        if (s->pixformat == PIXFORMAT_JPEG) {
            res = s->set_framesize(s, (framesize_t)val);
        }
    }
    else if (!strcmp(variable, "quality"))
        res = s->set_quality(s, val);
    else if (!strcmp(variable, "contrast"))
        res = s->set_contrast(s, val);
    else if (!strcmp(variable, "brightness"))
        res = s->set_brightness(s, val);
    else if (!strcmp(variable, "saturation"))
        res = s->set_saturation(s, val);
    else if (!strcmp(variable, "gainceiling"))
        res = s->set_gainceiling(s, (gainceiling_t)val);
    else if (!strcmp(variable, "colorbar"))
        res = s->set_colorbar(s, val);
    else if (!strcmp(variable, "awb"))
        res = s->set_whitebal(s, val);
    else if (!strcmp(variable, "agc"))
        res = s->set_gain_ctrl(s, val);
    else if (!strcmp(variable, "aec"))
        res = s->set_exposure_ctrl(s, val);
    else if (!strcmp(variable, "hmirror"))
        res = s->set_hmirror(s, val);
    else if (!strcmp(variable, "vflip"))
        res = s->set_vflip(s, val);
    else if (!strcmp(variable, "awb_gain"))
        res = s->set_awb_gain(s, val);
    else if (!strcmp(variable, "agc_gain"))
        res = s->set_agc_gain(s, val);
    else if (!strcmp(variable, "aec_value"))
        res = s->set_aec_value(s, val);
    else if (!strcmp(variable, "aec2"))
        res = s->set_aec2(s, val);
    else if (!strcmp(variable, "dcw"))
        res = s->set_dcw(s, val);
    else if (!strcmp(variable, "bpc"))
        res = s->set_bpc(s, val);
    else if (!strcmp(variable, "wpc"))
        res = s->set_wpc(s, val);
    else if (!strcmp(variable, "raw_gma"))
        res = s->set_raw_gma(s, val);
    else if (!strcmp(variable, "lenc"))
        res = s->set_lenc(s, val);
    else if (!strcmp(variable, "special_effect"))
        res = s->set_special_effect(s, val);
    else if (!strcmp(variable, "wb_mode"))
        res = s->set_wb_mode(s, val);
    else if (!strcmp(variable, "ae_level"))
        res = s->set_ae_level(s, val);
#if CONFIG_LED_ILLUMINATOR_ENABLED
    else if (!strcmp(variable, "led_intensity")) {
        led_duty = val;
        if (isStreaming)
            enable_led(true);
    }
#endif

#if CONFIG_ESP_FACE_DETECT_ENABLED
    else if (!strcmp(variable, "face_detect")) {
        detection_enabled = val;
#if CONFIG_ESP_FACE_RECOGNITION_ENABLED
        if (!detection_enabled) {
            recognition_enabled = 0;
        }
#endif
    }
#if CONFIG_ESP_FACE_RECOGNITION_ENABLED
    else if (!strcmp(variable, "face_enroll")){
        is_enrolling = !is_enrolling;
        log_i("Enrolling: %s", is_enrolling?"true":"false");
    }
    else if (!strcmp(variable, "face_recognize")) {
        recognition_enabled = val;
        if (recognition_enabled) {
            detection_enabled = val;
        }
    }
#endif
#endif
    else {
        log_i("Unknown command: %s", variable);
        res = -1;
    }

