YangQwQ/Stm32VisionSenseCar/Stm32-Vision/src/net/app_httpd.cpp
    httpd_uri_t win_uri = {
        .uri = "/resolution",
        .method = HTTP_GET,
        .handler = win_handler,
        .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
        ,
        .is_websocket = true,
        .handle_ws_control_frames = false,
        .supported_subprotocol = NULL
#endif
    };

    // AI 抓帧留档（调试）：清单 + 按序号取图。纯 GET，非 WS。
    httpd_uri_t ai_dump_uri = {
        .uri = "/ai_dump",
        .method = HTTP_GET,
        .handler = ai_dump_handler,
        .user_ctx = NULL
    };

    httpd_uri_t ai_frame_uri = {
        .uri = "/ai_frame",
        .method = HTTP_GET,
        .handler = ai_frame_handler,
        .user_ctx = NULL
    };

    // panic 现场（调试）：纯 GET，取 coredump 分区的摘要，见 coredump_handler 顶部注释。
    httpd_uri_t coredump_uri = {
        .uri = "/coredump",
        .method = HTTP_GET,
        .handler = coredump_handler,
        .user_ctx = NULL
    };

    ra_filter_init(&ra_filter, 20);

    // 统一日志模块转发器：WS 广播 + BLE 通知，供 /log 开启后把板端日志发手机。
    blog::set_forwarder(send_log_to_phone);

    // WS 发送锁：须在任何发送方（blog 转发任务、指令应答、ws_stream_task）启动前建好，
    // 否则那几路发送会在无锁状态下并发写 socket（见 s_ws_tx_mtx 注释）。
    if (!s_ws_tx_mtx) s_ws_tx_mtx = xSemaphoreCreateMutex();

#if CONFIG_ESP_FACE_RECOGNITION_ENABLED
    recognizer.set_partition(ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_ANY, "fr");

    // load ids from flash partition
    recognizer.set_ids_from_flash();
#endif
    log_i("Starting web server on port: '%d'", config.server_port);
    if (httpd_start(&camera_httpd, &config) == ESP_OK)
    {
        httpd_register_uri_handler(camera_httpd, &index_uri);
        httpd_register_uri_handler(camera_httpd, &cmd_uri);
        httpd_register_uri_handler(camera_httpd, &status_uri);
        httpd_register_uri_handler(camera_httpd, &capture_uri);
        httpd_register_uri_handler(camera_httpd, &zoomshot_uri);
        httpd_register_uri_handler(camera_httpd, &bmp_uri);

        httpd_register_uri_handler(camera_httpd, &xclk_uri);
        httpd_register_uri_handler(camera_httpd, &reg_uri);
        httpd_register_uri_handler(camera_httpd, &greg_uri);
        httpd_register_uri_handler(camera_httpd, &pll_uri);
        httpd_register_uri_handler(camera_httpd, &win_uri);
        httpd_register_uri_handler(camera_httpd, &ai_dump_uri);
        httpd_register_uri_handler(camera_httpd, &ai_frame_uri);
        httpd_register_uri_handler(camera_httpd, &coredump_uri);

        // 固件升级入口（GET 上传页 / POST 固件流），实现在 src/net/ota.cpp
        ota::http_register(camera_httpd);
    }

    config.server_port += 1;
    config.ctrl_port += 1;
    log_i("Starting stream server on port: '%d'", config.server_port);
    if (httpd_start(&stream_httpd, &config) == ESP_OK)
    {
        httpd_register_uri_handler(stream_httpd, &stream_uri);
#ifdef CONFIG_HTTPD_WS_SUPPORT
        httpd_register_uri_handler(stream_httpd, &ws_uri);
        // 栈先试 PSRAM（内部堆紧，见 heap_watch）：把 8KB 让回内部 DMA 池；失败退回内部栈保推流可用。
        if (!s_ws_stack) s_ws_stack = (StackType_t*)heap_caps_malloc(8192, MALLOC_CAP_SPIRAM);
        if (s_ws_stack) {
            xTaskCreateStaticPinnedToCore(ws_stream_task, "ws_stream", 8192, NULL, 5, s_ws_stack, &s_ws_tcb, 1);
        } else {
            xTaskCreatePinnedToCore(ws_stream_task, "ws_stream", 8192, NULL, 5, NULL, 1);
        }
#endif
    }
}

void setupLedFlash(int pin)
{
    #if CONFIG_LED_ILLUMINATOR_ENABLED
    s_led_pin = (uint8_t)pin;
    ledcAttach(pin, 5000, 8);  // core 3.x：引脚式绑定（频率 5kHz、8bit 分辨率）
    #else
    log_i("LED flash is disabled -> CONFIG_LED_ILLUMINATOR_ENABLED = 0");
    #endif
}
